
/*
 * Використовуючи Visual Studio, створіть проект за шаблоном Console Application.
 * Потрібно: Створити клас Vehicle. У тілі класу створіть поля: координати та
 * параметри суден (ціна, швидкість, рік випуску). Створіть 3 похідні класи
 * Plane, Саг і Ship. Для класу Plane має бути визначена висота та кількість
 * пасажирів. Для класу Ship – кількість пасажирів та порт приписки. Написати програму,
 * яка виводить на екран інформацію про кожен засіб пересування. 
 */

using Task3;

Car car = new Car(4400.00,140,2012,"Car");
Plane plane = new Plane(20000001.00,300,  2008,"Plane",
 200,15000.3);
Ship ship = new Ship(80030200211,40,2000,"ship",100,"Одеса");


car.ShowInfoFoVehicle();
ship.ShowInfoFoVehicle();
plane.ShowInfoFoVehicle();